[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:47:34
                     id="OrgCode"
                     type="text"
                     isInvalid={Boolean(errors.OrgCode)}
-                    {...register("OrgCode", {
+                    {...register("", {
                         required: "Organization Code is required"
                     })}
killedBy: UCSBOrganizationsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:48:35
                     type="text"
                     isInvalid={Boolean(errors.OrgCode)}
                     {...register("OrgCode", {
-                        required: "Organization Code is required"
+                        required: ""
                     })}
                 />
killedBy: UCSBOrganizationsForm tests Correct input used
statusReason: Error: Unable to find an element with the text: /Organization Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:52:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.OrgCode?.message}
+                    {errors.OrgCode.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: UCSBOrganizationsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:96:35
                     id="inactive"
                       as="select"
                       {...register("inactive", {
-                        required: "Inactive status is required"
+                        required: ""
                       })}
                     >
killedBy: UCSBOrganizationsForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Inactive status is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
