[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:5:79
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function UCSBOrganizationsForm({ initialContents, submitAction, buttonlabel = "Create" }) {
+function UCSBOrganizationsForm({ initialContents, submitAction, buttonlabel = "" }) {
 
 
killedBy: UCSBOrganizationsForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:26:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="orgCode">orgCode</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-orgCode"}
-                        id="orgCode"
-                        type="text"
-                        {...register("orgCode")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {initialContents || <Form.Group className="mb-3">
+                    <Form.Label htmlFor="orgCode">orgCode</Form.Label>
+                    <Form.Control data-testid={testIdPrefix + "-orgCode"} id="orgCode" type="text" {...register("orgCode")} value={initialContents.id} disabled />
+                </Form.Group>}
 
             <Form.Group className="mb-3">
killedBy: UCSBOrganizationsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:26:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                <Form.Group className="mb-3">
-                    <Form.Label htmlFor="orgCode">orgCode</Form.Label>
-                    <Form.Control
-                        data-testid={testIdPrefix + "-orgCode"}
-                        id="orgCode"
-                        type="text"
-                        {...register("orgCode")}
-                        value={initialContents.id}
-                        disabled
-                    />
-                </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3">
killedBy: UCSBOrganizationsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:47:57
                     id="orgTranslationShort"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
-                    {...register("orgTranslationShort", {
-                        required: "Short Organization Translation is required"
-                    })}
+                    {...register("orgTranslationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests Correct input used
statusReason: Error: Unable to find an element with the text: /Short Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:48:35
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
                     {...register("orgTranslationShort", {
-                        required: "Short Organization Translation is required"
+                        required: ""
                     })}
                 />
killedBy: UCSBOrganizationsForm tests Correct input used
statusReason: Error: Unable to find an element with the text: /Short Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:64:35
                     type="text"
                     isInvalid={Boolean(errors.orgTranslation)}
                     {...register("orgTranslation", {
-                        required: "Full Organization Translation is required"
+                        required: ""
                     })}
                 />
killedBy: UCSBOrganizationsForm tests Correct input used
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Full Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
