[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:5:79
 import { useForm } from 'react-hook-form';
 import { useNavigate } from 'react-router-dom';
 
-function UCSBOrganizationsForm({ initialContents, submitAction, buttonLabel = "Create" , orgCodeDisabled}) {
+function UCSBOrganizationsForm({ initialContents, submitAction, buttonLabel = "" , orgCodeDisabled}) {
 
 
killedBy: UCSBOrganizationsForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:33:38
                         id="orgCode"
                         type="text"
                         disabled={orgCodeDisabled}
-                        {...register("orgCode")}
+                        {...register("")}
                     />
                 </Form.Group>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationsForm.js:45:57
                     id="orgTranslationShort"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
-                    {...register("orgTranslationShort", {
-                        required: "Short Organization Translation is required",
-                        maxLength : {
-                            value: 100,
-                            message: "Max length 100 characters"
-                        }
-                    })}
+                    {...register("orgTranslationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Short Organization Translation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
