[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:12:20
 export default function UCSBOrganizationsTable({
     ucsbOrganizations,
     currentUser,
-    testIdPrefix = "UCSBOrganizationsTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: UCSBOrganizationsIndexPage tests renders three UCSBOrganization correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsTable-cell-row-0-col-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/components/UCSBOrganizations/UCSBOrganizationsTable.js:32:21
     // Stryker disable next-line all : TODO try to make a good test for this
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
-    const columns = [
-        {
-            Header: 'OrgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'OrgTranslationShort',
-            accessor: 'orgTranslationShort',
-        },
-        {
-            Header: 'OrgTranslation',
-            accessor: 'orgTranslation',
-        },
-        {
-            Header: 'Inactive',
-            id: 'inactive',
-            accessor: (row, _rowIndex) => String(row.inactive)
-        }
-    ];
+    const columns = [];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBOrganizationsTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: OrgCode. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
