[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:9:33
 
 export default function UCSBOrganizationsCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (organization) => ({
-        url:"/api/ucsborganizations/post",
-        method: "POST",
-        params: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
-    });
+    const objectToAxiosParams = () => undefined;
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationsCreatePage tests when submit, makes request to backend and redirects to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:10:13
 export default function UCSBOrganizationsCreatePage({storybook=false}) {
 
     const objectToAxiosParams = (organization) => ({
-        url:"/api/ucsborganizations/post",
+        url:"",
         method: "POST",
         params: {
killedBy: UCSBOrganizationsCreatePage tests when submit, makes request to backend and redirects to /ucsborganizations
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: SKY"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:12:17
     const objectToAxiosParams = (organization) => ({
         url:"/api/ucsborganizations/post",
         method: "POST",
-        params: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
+        params: {}
     });
 
killedBy: UCSBOrganizationsCreatePage tests when submit, makes request to backend and redirects to /ucsborganizations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Object {
-   "inactive": false,
-   "orgCode": "SKY",

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsCreatePage.js:20:41
         }
     });
 
-    const onSuccess = (organization) => {
-        toast(`New UCSB Organization Created - orgCode: ${organization.orgCode}`);
-    }
+    const onSuccess = (organization) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationsCreatePage tests when submit, makes request to backend and redirects to /ucsborganizations
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: SKY"

Number of calls: 0
