[Killed] ArrowFunction
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:23:36
             }
         );
 
-    const objectToAxiosPutParams = (organization) => ({
-        url: "/api/ucsborganizations",
-        method: "PUT",
-        params: {
-            orgCode: organization.orgCode
-        },
-        data: {
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: RAN"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:36:41
         }
     });
 
-    const onSuccess = (organization) => {
-        toast(`UCSB Organization Updated - orgCode: ${organization.orgCode}`);
-    }
+    const onSuccess = (organization) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:62:21
             <div className="pt-2">
                 <h1>Edit UCSB Organization</h1>
                 {
-                    organization && <UCSBOrganizationsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} orgCodeDisabled />
+                    true
                 }
             </div>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/UCSBOrganizations/UCSBOrganizationsEditPage.js:62:21
             <div className="pt-2">
                 <h1>Edit UCSB Organization</h1>
                 {
-                    organization && <UCSBOrganizationsForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organization} orgCodeDisabled />
+                    false
                 }
             </div>
killedBy: UCSBOrganizationsEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
