[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:23:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/ucsborganizations/create"
-                    style={{ float: "right" }}
-                >
-                    Create New Organization
-                </Button>
-            )
-        }
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create New Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBOrganizations/UCSBOrganizationsIndexPage.js:24:49
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/ucsborganizations/create"
-                    style={{ float: "right" }}
-                >
-                    Create New Organization
-                </Button>
-            )
-        }
+        if (hasRole(currentUser, "ROLE_ADMIN")) {}
     }
 
killedBy: UCSBOrganizationsIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create New Organization/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
